UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32h747_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32H747_gpio_v1_0_Modes.xml*/

#if !defined(_STM32H747_PINMUX_H_)
# define _STM32H747_PINMUX_H_

#define CEC_FUNC                 0
#define COMP1_OUT_FUNC           1
#define COMP2_OUT_FUNC           2
#define COMP_TIM1_BKIN_FUNC      3
#define CRS_SYNC_FUNC            4
#define DCMI_D0_FUNC             5
#define DCMI_D1_FUNC             6
#define DCMI_D10_FUNC            7
#define DCMI_D11_FUNC            8
#define DCMI_D12_FUNC            9
#define DCMI_D13_FUNC            10
#define DCMI_D2_FUNC             11
#define DCMI_D3_FUNC             12
#define DCMI_D4_FUNC             13
#define DCMI_D5_FUNC             14
#define DCMI_D6_FUNC             15
#define DCMI_D7_FUNC             16
#define DCMI_D8_FUNC             17
#define DCMI_D9_FUNC             18
#define DCMI_HSYNC_FUNC          19
#define DCMI_PIXCLK_FUNC         20
#define DCMI_VSYNC_FUNC          21
#define DEBUG_JTCK_SWCLK_FUNC    22
#define DEBUG_JTDI_FUNC          23
#define DEBUG_JTDO_SWO_FUNC      24
#define DEBUG_JTMS_SWDIO_FUNC    25
#define DEBUG_TRACECLK_FUNC      26
#define DEBUG_TRACED0_FUNC       27
#define DEBUG_TRACED1_FUNC       28
#define DEBUG_TRACED2_FUNC       29
#define DEBUG_TRACED3_FUNC       30
#define DEBUG_TRGIN_FUNC         31
#define DEBUG_TRGIO_FUNC         32
#define DEBUG_TRGOUT_FUNC        33
#define DFSDM1_CKIN0_FUNC        34
#define DFSDM1_CKIN1_FUNC        35
#define DFSDM1_CKIN2_FUNC        36
#define DFSDM1_CKIN3_FUNC        37
#define DFSDM1_CKIN4_FUNC        38
#define DFSDM1_CKIN5_FUNC        39
#define DFSDM1_CKIN6_FUNC        40
#define DFSDM1_CKIN7_FUNC        41
#define DFSDM1_CKOUT_FUNC        42
#define DFSDM1_DATIN0_FUNC       43
#define DFSDM1_DATIN1_FUNC       44
#define DFSDM1_DATIN2_FUNC       45
#define DFSDM1_DATIN3_FUNC       46
#define DFSDM1_DATIN4_FUNC       47
#define DFSDM1_DATIN5_FUNC       48
#define DFSDM1_DATIN6_FUNC       49
#define DFSDM1_DATIN7_FUNC       50
#define DSIHOST_TE_FUNC          51
#define ETH_COL_FUNC             52
#define ETH_CRS_FUNC             53
#define ETH_CRS_DV_FUNC          54
#define ETH_MDC_FUNC             55
#define ETH_MDIO_FUNC            56
#define ETH_PPS_OUT_FUNC         57
#define ETH_REF_CLK_FUNC         58
#define ETH_RXD0_FUNC            59
#define ETH_RXD1_FUNC            60
#define ETH_RXD2_FUNC            61
#define ETH_RXD3_FUNC            62
#define ETH_RX_CLK_FUNC          63
#define ETH_RX_DV_FUNC           64
#define ETH_RX_ER_FUNC           65
#define ETH_TXD0_FUNC            66
#define ETH_TXD1_FUNC            67
#define ETH_TXD2_FUNC            68
#define ETH_TXD3_FUNC            69
#define ETH_TX_CLK_FUNC          70
#define ETH_TX_EN_FUNC           71
#define FDCAN1_RX_FUNC           72
#define FDCAN1_TX_FUNC           73
#define FDCAN2_RX_FUNC           74
#define FDCAN2_TX_FUNC           75
#define FMC_A0_FUNC              76
#define FMC_A1_FUNC              77
#define FMC_A10_FUNC             78
#define FMC_A11_FUNC             79
#define FMC_A12_FUNC             80
#define FMC_A13_FUNC             81
#define FMC_A14_FUNC             82
#define FMC_A15_FUNC             83
#define FMC_A16_FUNC             84
#define FMC_A17_FUNC             85
#define FMC_A18_FUNC             86
#define FMC_A19_FUNC             87
#define FMC_A2_FUNC              88
#define FMC_A20_FUNC             89
#define FMC_A21_FUNC             90
#define FMC_A22_FUNC             91
#define FMC_A23_FUNC             92
#define FMC_A24_FUNC             93
#define FMC_A25_FUNC             94
#define FMC_A3_FUNC              95
#define FMC_A4_FUNC              96
#define FMC_A5_FUNC              97
#define FMC_A6_FUNC              98
#define FMC_A7_FUNC              99
#define FMC_A8_FUNC              100
#define FMC_A9_FUNC              101
#define FMC_BA0_FUNC             102
#define FMC_BA1_FUNC             103
#define FMC_CLK_FUNC             104
#define FMC_D0_FUNC              105
#define FMC_D1_FUNC              106
#define FMC_D10_FUNC             107
#define FMC_D11_FUNC             108
#define FMC_D12_FUNC             109
#define FMC_D13_FUNC             110
#define FMC_D14_FUNC             111
#define FMC_D15_FUNC             112
#define FMC_D16_FUNC             113
#define FMC_D17_FUNC             114
#define FMC_D18_FUNC             115
#define FMC_D19_FUNC             116
#define FMC_D2_FUNC              117
#define FMC_D20_FUNC             118
#define FMC_D21_FUNC             119
#define FMC_D22_FUNC             120
#define FMC_D23_FUNC             121
#define FMC_D24_FUNC             122
#define FMC_D25_FUNC             123
#define FMC_D26_FUNC             124
#define FMC_D27_FUNC             125
#define FMC_D28_FUNC             126
#define FMC_D29_FUNC             127
#define FMC_D3_FUNC              128
#define FMC_D30_FUNC             129
#define FMC_D31_FUNC             130
#define FMC_D4_FUNC              131
#define FMC_D5_FUNC              132
#define FMC_D6_FUNC              133
#define FMC_D7_FUNC              134
#define FMC_D8_FUNC              135
#define FMC_D9_FUNC              136
#define FMC_DA0_FUNC             137
#define FMC_DA1_FUNC             138
#define FMC_DA10_FUNC            139
#define FMC_DA11_FUNC            140
#define FMC_DA12_FUNC            141
#define FMC_DA13_FUNC            142
#define FMC_DA14_FUNC            143
#define FMC_DA15_FUNC            144
#define FMC_DA2_FUNC             145
#define FMC_DA3_FUNC             146
#define FMC_DA4_FUNC             147
#define FMC_DA5_FUNC             148
#define FMC_DA6_FUNC             149
#define FMC_DA7_FUNC             150
#define FMC_DA8_FUNC             151
#define FMC_DA9_FUNC             152
#define FMC_INT_FUNC             153
#define FMC_NBL0_FUNC            154
#define FMC_NBL1_FUNC            155
#define FMC_NBL2_FUNC            156
#define FMC_NBL3_FUNC            157
#define FMC_NCE_FUNC             158
#define FMC_NE1_FUNC             159
#define FMC_NE2_FUNC             160
#define FMC_NE3_FUNC             161
#define FMC_NE4_FUNC             162
#define FMC_NL_FUNC              163
#define FMC_NOE_FUNC             164
#define FMC_NWAIT_FUNC           165
#define FMC_NWE_FUNC             166
#define FMC_SDCKE0_FUNC          167
#define FMC_SDCKE1_FUNC          168
#define FMC_SDCLK_FUNC           169
#define FMC_SDNCAS_FUNC          170
#define FMC_SDNE0_FUNC           171
#define FMC_SDNE1_FUNC           172
#define FMC_SDNRAS_FUNC          173
#define FMC_SDNWE_FUNC           174
#define HRTIM_CHA1_FUNC          175
#define HRTIM_CHA2_FUNC          176
#define HRTIM_CHB1_FUNC          177
#define HRTIM_CHB2_FUNC          178
#define HRTIM_CHC1_FUNC          179
#define HRTIM_CHC2_FUNC          180
#define HRTIM_CHD1_FUNC          181
#define HRTIM_CHD2_FUNC          182
#define HRTIM_CHE1_FUNC          183
#define HRTIM_CHE2_FUNC          184
#define HRTIM_EEV1_FUNC          185
#define HRTIM_EEV10_FUNC         186
#define HRTIM_EEV2_FUNC          187
#define HRTIM_EEV3_FUNC          188
#define HRTIM_EEV4_FUNC          189
#define HRTIM_EEV5_FUNC          190
#define HRTIM_EEV6_FUNC          191
#define HRTIM_EEV7_FUNC          192
#define HRTIM_EEV8_FUNC          193
#define HRTIM_EEV9_FUNC          194
#define HRTIM_FLT1_FUNC          195
#define HRTIM_FLT2_FUNC          196
#define HRTIM_FLT3_FUNC          197
#define HRTIM_FLT4_FUNC          198
#define HRTIM_FLT5_FUNC          199
#define HRTIM_SCIN_FUNC          200
#define HRTIM_SCOUT_FUNC         201
#define I2C1_SCL_FUNC            202
#define I2C1_SDA_FUNC            203
#define I2C1_SMBA_FUNC           204
#define I2C2_SCL_FUNC            205
#define I2C2_SDA_FUNC            206
#define I2C2_SMBA_FUNC           207
#define I2C3_SCL_FUNC            208
#define I2C3_SDA_FUNC            209
#define I2C3_SMBA_FUNC           210
#define I2C4_SCL_FUNC            211
#define I2C4_SDA_FUNC            212
#define I2C4_SMBA_FUNC           213
#define I2S1_CK_FUNC             214
#define I2S1_MCK_FUNC            215
#define I2S1_SDI_FUNC            216
#define I2S1_SDO_FUNC            217
#define I2S1_WS_FUNC             218
#define I2S2_CK_FUNC             219
#define I2S2_MCK_FUNC            220
#define I2S2_SDI_FUNC            221
#define I2S2_SDO_FUNC            222
#define I2S2_WS_FUNC             223
#define I2S3_CK_FUNC             224
#define I2S3_MCK_FUNC            225
#define I2S3_SDI_FUNC            226
#define I2S3_SDO_FUNC            227
#define I2S3_WS_FUNC             228
#define I2S_CKIN_FUNC            229
#define LPTIM1_ETR_FUNC          230
#define LPTIM1_IN1_FUNC          231
#define LPTIM1_IN2_FUNC          232
#define LPTIM1_OUT_FUNC          233
#define LPTIM2_ETR_FUNC          234
#define LPTIM2_IN1_FUNC          235
#define LPTIM2_IN2_FUNC          236
#define LPTIM2_OUT_FUNC          237
#define LPTIM3_OUT_FUNC          238
#define LPTIM4_OUT_FUNC          239
#define LPTIM5_OUT_FUNC          240
#define LPUART1_CTS_FUNC         241
#define LPUART1_DE_FUNC          242
#define LPUART1_RTS_FUNC         243
#define LPUART1_RX_FUNC          244
#define LPUART1_TX_FUNC          245
#define LTDC_B0_FUNC             246
#define LTDC_B1_FUNC             247
#define LTDC_B2_FUNC             248
#define LTDC_B3_FUNC             249
#define LTDC_B4_FUNC             250
#define LTDC_B5_FUNC             251
#define LTDC_B6_FUNC             252
#define LTDC_B7_FUNC             253
#define LTDC_CLK_FUNC            254
#define LTDC_DE_FUNC             255
#define LTDC_G0_FUNC             256
#define LTDC_G1_FUNC             257
#define LTDC_G2_FUNC             258
#define LTDC_G3_FUNC             259
#define LTDC_G4_FUNC             260
#define LTDC_G5_FUNC             261
#define LTDC_G6_FUNC             262
#define LTDC_G7_FUNC             263
#define LTDC_HSYNC_FUNC          264
#define LTDC_R0_FUNC             265
#define LTDC_R1_FUNC             266
#define LTDC_R2_FUNC             267
#define LTDC_R3_FUNC             268
#define LTDC_R4_FUNC             269
#define LTDC_R5_FUNC             270
#define LTDC_R6_FUNC             271
#define LTDC_R7_FUNC             272
#define LTDC_VSYNC_FUNC          273
#define MDIOS_MDC_FUNC           274
#define MDIOS_MDIO_FUNC          275
#define QUADSPI_BK1_IO0_FUNC     276
#define QUADSPI_BK1_IO1_FUNC     277
#define QUADSPI_BK1_IO2_FUNC     278
#define QUADSPI_BK1_IO3_FUNC     279
#define QUADSPI_BK1_NCS_FUNC     280
#define QUADSPI_BK2_IO0_FUNC     281
#define QUADSPI_BK2_IO1_FUNC     282
#define QUADSPI_BK2_IO2_FUNC     283
#define QUADSPI_BK2_IO3_FUNC     284
#define QUADSPI_BK2_NCS_FUNC     285
#define QUADSPI_CLK_FUNC         286
#define RCC_MCO_1_FUNC           287
#define RCC_MCO_2_FUNC           288
#define RTC_OUT_ALARM_FUNC       289
#define RTC_OUT_CALIB_FUNC       290
#define RTC_REFIN_FUNC           291
#define SAI1_CK1_FUNC            292
#define SAI1_CK2_FUNC            293
#define SAI1_D1_FUNC             294
#define SAI1_D2_FUNC             295
#define SAI1_D3_FUNC             296
#define SAI1_FS_A_FUNC           297
#define SAI1_FS_B_FUNC           298
#define SAI1_MCLK_A_FUNC         299
#define SAI1_MCLK_B_FUNC         300
#define SAI1_SCK_A_FUNC          301
#define SAI1_SCK_B_FUNC          302
#define SAI1_SD_A_FUNC           303
#define SAI1_SD_B_FUNC           304
#define SAI2_FS_A_FUNC           305
#define SAI2_FS_B_FUNC           306
#define SAI2_MCLK_A_FUNC         307
#define SAI2_MCLK_B_FUNC         308
#define SAI2_SCK_A_FUNC          309
#define SAI2_SCK_B_FUNC          310
#define SAI2_SD_A_FUNC           311
#define SAI2_SD_B_FUNC           312
#define SAI3_FS_A_FUNC           313
#define SAI3_FS_B_FUNC           314
#define SAI3_MCLK_A_FUNC         315
#define SAI3_MCLK_B_FUNC         316
#define SAI3_SCK_A_FUNC          317
#define SAI3_SCK_B_FUNC          318
#define SAI3_SD_A_FUNC           319
#define SAI3_SD_B_FUNC           320
#define SAI4_CK1_FUNC            321
#define SAI4_CK2_FUNC            322
#define SAI4_D1_FUNC             323
#define SAI4_D2_FUNC             324
#define SAI4_D3_FUNC             325
#define SAI4_FS_A_FUNC           326
#define SAI4_FS_B_FUNC           327
#define SAI4_MCLK_A_FUNC         328
#define SAI4_MCLK_B_FUNC         329
#define SAI4_SCK_A_FUNC          330
#define SAI4_SCK_B_FUNC          331
#define SAI4_SD_A_FUNC           332
#define SAI4_SD_B_FUNC           333
#define SDMMC1_CDIR_FUNC         334
#define SDMMC1_CK_FUNC           335
#define SDMMC1_CKIN_FUNC         336
#define SDMMC1_CMD_FUNC          337
#define SDMMC1_D0_FUNC           338
#define SDMMC1_D0DIR_FUNC        339
#define SDMMC1_D1_FUNC           340
#define SDMMC1_D123DIR_FUNC      341
#define SDMMC1_D2_FUNC           342
#define SDMMC1_D3_FUNC           343
#define SDMMC1_D4_FUNC           344
#define SDMMC1_D5_FUNC           345
#define SDMMC1_D6_FUNC           346
#define SDMMC1_D7_FUNC           347
#define SDMMC2_CK_FUNC           348
#define SDMMC2_CMD_FUNC          349
#define SDMMC2_D0_FUNC           350
#define SDMMC2_D1_FUNC           351
#define SDMMC2_D2_FUNC           352
#define SDMMC2_D3_FUNC           353
#define SDMMC2_D4_FUNC           354
#define SDMMC2_D5_FUNC           355
#define SDMMC2_D6_FUNC           356
#define SDMMC2_D7_FUNC           357
#define SPDIFRX1_IN0_FUNC        358
#define SPDIFRX1_IN1_FUNC        359
#define SPDIFRX1_IN2_FUNC        360
#define SPDIFRX1_IN3_FUNC        361
#define SPI1_MISO_FUNC           362
#define SPI1_MOSI_FUNC           363
#define SPI1_NSS_FUNC            364
#define SPI1_SCK_FUNC            365
#define SPI2_MISO_FUNC           366
#define SPI2_MOSI_FUNC           367
#define SPI2_NSS_FUNC            368
#define SPI2_SCK_FUNC            369
#define SPI3_MISO_FUNC           370
#define SPI3_MOSI_FUNC           371
#define SPI3_NSS_FUNC            372
#define SPI3_SCK_FUNC            373
#define SPI4_MISO_FUNC           374
#define SPI4_MOSI_FUNC           375
#define SPI4_NSS_FUNC            376
#define SPI4_SCK_FUNC            377
#define SPI5_MISO_FUNC           378
#define SPI5_MOSI_FUNC           379
#define SPI5_NSS_FUNC            380
#define SPI5_SCK_FUNC            381
#define SPI6_MISO_FUNC           382
#define SPI6_MOSI_FUNC           383
#define SPI6_NSS_FUNC            384
#define SPI6_SCK_FUNC            385
#define SWPMI1_RX_FUNC           386
#define SWPMI1_SUSPEND_FUNC      387
#define SWPMI1_TX_FUNC           388
#define SYS_JTRST_FUNC           389
#define TIM12_CH1_FUNC           390
#define TIM12_CH2_FUNC           391
#define TIM13_CH1_FUNC           392
#define TIM14_CH1_FUNC           393
#define TIM15_BKIN_FUNC          394
#define TIM15_CH1_FUNC           395
#define TIM15_CH1N_FUNC          396
#define TIM15_CH2_FUNC           397
#define TIM16_BKIN_FUNC          398
#define TIM16_CH1_FUNC           399
#define TIM16_CH1N_FUNC          400
#define TIM17_BKIN_FUNC          401
#define TIM17_CH1_FUNC           402
#define TIM17_CH1N_FUNC          403
#define TIM1_BKIN_FUNC           404
#define TIM1_BKIN2_FUNC          405
#define TIM1_BKIN2_COMP1_FUNC    406
#define TIM1_BKIN2_COMP2_FUNC    407
#define TIM1_BKIN_COMP1_FUNC     408
#define TIM1_BKIN_COMP2_FUNC     409
#define TIM1_CH1_FUNC            410
#define TIM1_CH1N_FUNC           411
#define TIM1_CH2_FUNC            412
#define TIM1_CH2N_FUNC           413
#define TIM1_CH3_FUNC            414
#define TIM1_CH3N_FUNC           415
#define TIM1_CH4_FUNC            416
#define TIM1_ETR_FUNC            417
#define TIM2_CH1_FUNC            418
#define TIM2_CH2_FUNC            419
#define TIM2_CH3_FUNC            420
#define TIM2_CH4_FUNC            421
#define TIM2_ETR_FUNC            422
#define TIM3_CH1_FUNC            423
#define TIM3_CH2_FUNC            424
#define TIM3_CH3_FUNC            425
#define TIM3_CH4_FUNC            426
#define TIM3_ETR_FUNC            427
#define TIM4_CH1_FUNC            428
#define TIM4_CH2_FUNC            429
#define TIM4_CH3_FUNC            430
#define TIM4_CH4_FUNC            431
#define TIM4_ETR_FUNC            432
#define TIM5_CH1_FUNC            433
#define TIM5_CH2_FUNC            434
#define TIM5_CH3_FUNC            435
#define TIM5_CH4_FUNC            436
#define TIM5_ETR_FUNC            437
#define TIM8_BKIN_FUNC           438
#define TIM8_BKIN2_FUNC          439
#define TIM8_BKIN2_COMP1_FUNC    440
#define TIM8_BKIN2_COMP2_FUNC    441
#define TIM8_BKIN_COMP1_FUNC     442
#define TIM8_BKIN_COMP2_FUNC     443
#define TIM8_CH1_FUNC            444
#define TIM8_CH1N_FUNC           445
#define TIM8_CH2_FUNC            446
#define TIM8_CH2N_FUNC           447
#define TIM8_CH3_FUNC            448
#define TIM8_CH3N_FUNC           449
#define TIM8_CH4_FUNC            450
#define TIM8_ETR_FUNC            451
#define UART4_CTS_FUNC           452
#define UART4_DE_FUNC            453
#define UART4_RTS_FUNC           454
#define UART4_RX_FUNC            455
#define UART4_TX_FUNC            456
#define UART5_CTS_FUNC           457
#define UART5_DE_FUNC            458
#define UART5_RTS_FUNC           459
#define UART5_RX_FUNC            460
#define UART5_TX_FUNC            461
#define UART7_CTS_FUNC           462
#define UART7_DE_FUNC            463
#define UART7_RTS_FUNC           464
#define UART7_RX_FUNC            465
#define UART7_TX_FUNC            466
#define UART8_CTS_FUNC           467
#define UART8_DE_FUNC            468
#define UART8_RTS_FUNC           469
#define UART8_RX_FUNC            470
#define UART8_TX_FUNC            471
#define USART1_CK_FUNC           472
#define UART1_CK_FUNC            472
#define USART1_CTS_FUNC          473
#define UART1_CTS_FUNC           473
#define USART1_DE_FUNC           474
#define UART1_DE_FUNC            474
#define USART1_NSS_FUNC          475
#define UART1_NSS_FUNC           475
#define USART1_RTS_FUNC          476
#define UART1_RTS_FUNC           476
#define USART1_RX_FUNC           477
#define UART1_RX_FUNC            477
#define USART1_TX_FUNC           478
#define UART1_TX_FUNC            478
#define USART2_CK_FUNC           479
#define UART2_CK_FUNC            479
#define USART2_CTS_FUNC          480
#define UART2_CTS_FUNC           480
#define USART2_DE_FUNC           481
#define UART2_DE_FUNC            481
#define USART2_NSS_FUNC          482
#define UART2_NSS_FUNC           482
#define USART2_RTS_FUNC          483
#define UART2_RTS_FUNC           483
#define USART2_RX_FUNC           484
#define UART2_RX_FUNC            484
#define USART2_TX_FUNC           485
#define UART2_TX_FUNC            485
#define USART3_CK_FUNC           486
#define UART3_CK_FUNC            486
#define USART3_CTS_FUNC          487
#define UART3_CTS_FUNC           487
#define USART3_DE_FUNC           488
#define UART3_DE_FUNC            488
#define USART3_NSS_FUNC          489
#define UART3_NSS_FUNC           489
#define USART3_RTS_FUNC          490
#define UART3_RTS_FUNC           490
#define USART3_RX_FUNC           491
#define UART3_RX_FUNC            491
#define USART3_TX_FUNC           492
#define UART3_TX_FUNC            492
#define USART6_CK_FUNC           493
#define UART6_CK_FUNC            493
#define USART6_CTS_FUNC          494
#define UART6_CTS_FUNC           494
#define USART6_DE_FUNC           495
#define UART6_DE_FUNC            495
#define USART6_NSS_FUNC          496
#define UART6_NSS_FUNC           496
#define USART6_RTS_FUNC          497
#define UART6_RTS_FUNC           497
#define USART6_RX_FUNC           498
#define UART6_RX_FUNC            498
#define USART6_TX_FUNC           499
#define UART6_TX_FUNC            499
#define USB_OTG_FS_DM_FUNC       500
#define USB_OTG_FS_DP_FUNC       501
#define USB_OTG_FS_ID_FUNC       502
#define USB_OTG_FS_SOF_FUNC      503
#define USB_OTG_HS_DM_FUNC       504
#define USB_OTG_HS_DP_FUNC       505
#define USB_OTG_HS_ID_FUNC       506
#define USB_OTG_HS_SOF_FUNC      507
#define USB_OTG_HS_ULPI_CK_FUNC  508
#define USB_OTG_HS_ULPI_D0_FUNC  509
#define USB_OTG_HS_ULPI_D1_FUNC  510
#define USB_OTG_HS_ULPI_D2_FUNC  511
#define USB_OTG_HS_ULPI_D3_FUNC  512
#define USB_OTG_HS_ULPI_D4_FUNC  513
#define USB_OTG_HS_ULPI_D5_FUNC  514
#define USB_OTG_HS_ULPI_D6_FUNC  515
#define USB_OTG_HS_ULPI_D7_FUNC  516
#define USB_OTG_HS_ULPI_DIR_FUNC 517
#define USB_OTG_HS_ULPI_NXT_FUNC 518
#define USB_OTG_HS_ULPI_STP_FUNC 519

