UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32h747_pinmux.h
	((gpio == PF09) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PF09) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PF10) && (func == TIM16_BKIN_FUNC          )) ?  1 : \
	((gpio == PF10) && (func == SAI1_D3_FUNC             )) ?  2 : \
	((gpio == PF10) && (func == QUADSPI_CLK_FUNC         )) ?  9 : \
	((gpio == PF10) && (func == SAI4_D3_FUNC             )) ? 10 : \
	((gpio == PF10) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PF10) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PF11) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PF11) && (func == FMC_SDNRAS_FUNC          )) ? 12 : \
	((gpio == PF11) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == DFSDM1_DATIN6_FUNC       )) ?  3 : \
	((gpio == PF13) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == DFSDM1_CKIN6_FUNC        )) ?  3 : \
	((gpio == PF14) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PG02) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 11 : \
	((gpio == PG02) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 11 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PG03) && (func == TIM8_BKIN2_COMP1_FUNC    )) ? 11 : \
	((gpio == PG03) && (func == TIM8_BKIN2_COMP2_FUNC    )) ? 11 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == TIM1_BKIN2_FUNC          )) ?  1 : \
	((gpio == PG04) && (func == TIM1_BKIN2_COMP1_FUNC    )) ? 11 : \
	((gpio == PG04) && (func == TIM1_BKIN2_COMP2_FUNC    )) ? 11 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_BA0_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_BA1_FUNC             )) ? 12 : \
	((gpio == PG06) && (func == TIM17_BKIN_FUNC          )) ?  1 : \
	((gpio == PG06) && (func == HRTIM_CHE1_FUNC          )) ?  2 : \
	((gpio == PG06) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PG06) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG06) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PG06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PG07) && (func == HRTIM_CHE2_FUNC          )) ?  2 : \
	((gpio == PG07) && (func == SAI1_MCLK_A_FUNC         )) ?  6 : \
	((gpio == PG07) && (func == USART6_CK_FUNC           )) ?  7 : \
	((gpio == PG07) && (func == FMC_INT_FUNC             )) ? 12 : \
	((gpio == PG07) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PG07) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PG08) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PG08) && (func == SPI6_NSS_FUNC            )) ?  5 : \
	((gpio == PG08) && (func == USART6_DE_FUNC           )) ?  7 : \
	((gpio == PG08) && (func == USART6_RTS_FUNC          )) ?  7 : \
	((gpio == PG08) && (func == SPDIFRX1_IN2_FUNC        )) ?  8 : \
	((gpio == PG08) && (func == ETH_PPS_OUT_FUNC         )) ? 11 : \
	((gpio == PG08) && (func == FMC_SDCLK_FUNC           )) ? 12 : \
	((gpio == PG08) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PG09) && (func == I2S1_SDI_FUNC            )) ?  5 : \
	((gpio == PG09) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PG09) && (func == USART6_RX_FUNC           )) ?  7 : \
	((gpio == PG09) && (func == SPDIFRX1_IN3_FUNC        )) ?  8 : \
	((gpio == PG09) && (func == QUADSPI_BK2_IO2_FUNC     )) ?  9 : \
	((gpio == PG09) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PG09) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PG10) && (func == HRTIM_FLT5_FUNC          )) ?  2 : \
	((gpio == PG10) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PG10) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PG10) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PG10) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PG10) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG10) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PG10) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PG11) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PG11) && (func == HRTIM_EEV4_FUNC          )) ?  2 : \
	((gpio == PG11) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PG11) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PG11) && (func == SPDIFRX1_IN0_FUNC        )) ?  8 : \
	((gpio == PG11) && (func == SDMMC2_D2_FUNC           )) ? 10 : \
	((gpio == PG11) && (func == ETH_TX_EN_FUNC           )) ? 11 : \
	((gpio == PG11) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PG11) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PG12) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PG12) && (func == HRTIM_EEV5_FUNC          )) ?  2 : \
	((gpio == PG12) && (func == SPI6_MISO_FUNC           )) ?  5 : \
	((gpio == PG12) && (func == USART6_DE_FUNC           )) ?  7 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  7 : \
	((gpio == PG12) && (func == SPDIFRX1_IN1_FUNC        )) ?  8 : \
	((gpio == PG12) && (func == LTDC_B4_FUNC             )) ?  9 : \
	((gpio == PG12) && (func == ETH_TXD1_FUNC            )) ? 11 : \
	((gpio == PG12) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PG12) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PG13) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PG13) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PG13) && (func == HRTIM_EEV10_FUNC         )) ?  2 : \
	((gpio == PG13) && (func == SPI6_SCK_FUNC            )) ?  5 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  7 : \
	((gpio == PG13) && (func == USART6_NSS_FUNC          )) ?  7 : \
	((gpio == PG13) && (func == ETH_TXD0_FUNC            )) ? 11 : \
	((gpio == PG13) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PG13) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PG14) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PG14) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PG14) && (func == SPI6_MOSI_FUNC           )) ?  5 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  7 : \
	((gpio == PG14) && (func == QUADSPI_BK2_IO3_FUNC     )) ?  9 : \
	((gpio == PG14) && (func == ETH_TXD1_FUNC            )) ? 11 : \
	((gpio == PG14) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PG14) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  7 : \
	((gpio == PG15) && (func == USART6_NSS_FUNC          )) ?  7 : \
	((gpio == PG15) && (func == FMC_SDNCAS_FUNC          )) ? 12 : \
	((gpio == PG15) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PH02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PH02) && (func == QUADSPI_BK2_IO0_FUNC     )) ?  9 : \
	((gpio == PH02) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PH02) && (func == ETH_CRS_FUNC             )) ? 11 : \
	((gpio == PH02) && (func == FMC_SDCKE0_FUNC          )) ? 12 : \
	((gpio == PH02) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PH03) && (func == QUADSPI_BK2_IO1_FUNC     )) ?  9 : \
	((gpio == PH03) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PH03) && (func == ETH_COL_FUNC             )) ? 11 : \
	((gpio == PH03) && (func == FMC_SDNE0_FUNC           )) ? 12 : \
	((gpio == PH03) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PH04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PH04) && (func == LTDC_G5_FUNC             )) ?  9 : \
	((gpio == PH04) && (func == USB_OTG_HS_ULPI_NXT_FUNC )) ? 10 : \
	((gpio == PH04) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PH05) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PH05) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PH05) && (func == FMC_SDNWE_FUNC           )) ? 12 : \
	((gpio == PH06) && (func == TIM12_CH1_FUNC           )) ?  2 : \
	((gpio == PH06) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PH06) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PH06) && (func == ETH_RXD2_FUNC            )) ? 11 : \
	((gpio == PH06) && (func == FMC_SDNE1_FUNC           )) ? 12 : \
	((gpio == PH06) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PH07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PH07) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PH07) && (func == ETH_RXD3_FUNC            )) ? 11 : \
	((gpio == PH07) && (func == FMC_SDCKE1_FUNC          )) ? 12 : \
	((gpio == PH07) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PH08) && (func == TIM5_ETR_FUNC            )) ?  2 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == FMC_D16_FUNC             )) ? 12 : \
	((gpio == PH08) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PH08) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PH09) && (func == TIM12_CH2_FUNC           )) ?  2 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == FMC_D17_FUNC             )) ? 12 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PH10) && (func == FMC_D18_FUNC             )) ? 12 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PH11) && (func == FMC_D19_FUNC             )) ? 12 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PH12) && (func == FMC_D20_FUNC             )) ? 12 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PH13) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PH13) && (func == FMC_D21_FUNC             )) ? 12 : \
	((gpio == PH13) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PH14) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PH14) && (func == FMC_D22_FUNC             )) ? 12 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == FMC_D23_FUNC             )) ? 12 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == FMC_D24_FUNC             )) ? 12 : \
	((gpio == PI00) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PI00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PI01) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PI01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == TIM8_BKIN2_COMP1_FUNC    )) ? 11 : \
	((gpio == PI01) && (func == TIM8_BKIN2_COMP2_FUNC    )) ? 11 : \
	((gpio == PI01) && (func == FMC_D25_FUNC             )) ? 12 : \
	((gpio == PI01) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PI01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == I2S2_SDI_FUNC            )) ?  5 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == FMC_D26_FUNC             )) ? 12 : \
	((gpio == PI02) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PI02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == I2S2_SDO_FUNC            )) ?  5 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == FMC_D27_FUNC             )) ? 12 : \
	((gpio == PI03) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == SAI2_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PI04) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 11 : \
	((gpio == PI04) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 11 : \
	((gpio == PI04) && (func == FMC_NBL2_FUNC            )) ? 12 : \
	((gpio == PI04) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PI04) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == SAI2_SCK_A_FUNC          )) ? 10 : \
	((gpio == PI05) && (func == FMC_NBL3_FUNC            )) ? 12 : \
	((gpio == PI05) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PI05) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == SAI2_SD_A_FUNC           )) ? 10 : \
	((gpio == PI06) && (func == FMC_D28_FUNC             )) ? 12 : \
	((gpio == PI06) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PI06) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == SAI2_FS_A_FUNC           )) ? 10 : \
	((gpio == PI07) && (func == FMC_D29_FUNC             )) ? 12 : \
	((gpio == PI07) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PI07) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PI09) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PI09) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PI09) && (func == FMC_D30_FUNC             )) ? 12 : \
	((gpio == PI09) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI10) && (func == ETH_RX_ER_FUNC           )) ? 11 : \
	((gpio == PI10) && (func == FMC_D31_FUNC             )) ? 12 : \
	((gpio == PI10) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI11) && (func == LTDC_G6_FUNC             )) ?  9 : \
	((gpio == PI11) && (func == USB_OTG_HS_ULPI_DIR_FUNC )) ? 10 : \
	((gpio == PI12) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI13) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PI15) && (func == LTDC_G2_FUNC             )) ?  9 : \
	((gpio == PI15) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PJ00) && (func == LTDC_R7_FUNC             )) ?  9 : \
	((gpio == PJ00) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PJ01) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PJ02) && (func == DSIHOST_TE_FUNC          )) ? 13 : \
	((gpio == PJ02) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PJ03) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PJ04) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PJ05) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PJ06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PJ06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PJ07) && (func == DEBUG_TRGIN_FUNC         )) ?  0 : \
	((gpio == PJ07) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PJ07) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PJ08) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PJ08) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PJ08) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PJ08) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PJ09) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PJ09) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PJ09) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PJ09) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PJ10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PJ10) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PJ10) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PJ10) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PJ11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PJ11) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PJ11) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PJ11) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PJ12) && (func == DEBUG_TRGOUT_FUNC        )) ?  0 : \
	((gpio == PJ12) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PJ12) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PJ13) && (func == LTDC_B4_FUNC             )) ?  9 : \
	((gpio == PJ13) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PJ14) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PJ15) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PK00) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PK00) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PK00) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PK00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PK01) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PK01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PK01) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PK01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PK02) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PK02) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PK02) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 10 : \
	((gpio == PK02) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 10 : \
	((gpio == PK02) && (func == TIM1_BKIN_COMP1_FUNC     )) ? 11 : \
	((gpio == PK02) && (func == TIM1_BKIN_COMP2_FUNC     )) ? 11 : \
	((gpio == PK02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PK03) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PK04) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PK05) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PK06) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PK07) && (func == LTDC_DE_FUNC             )) ? 14 : \
	AF_NO_SUCH_PINFUNC)

